app/controllers/reports_controller.rb

SELECT COUNT(*) FROM "resources" WHERE "resources"."type" = ?  [["type", "Medication"]]
---
  def resources_by_survivor
    render json: {
      water: Resource.water.count.to_f / survivor_count,
      food: Resource.food.count.to_f / survivor_count,
      medication: Resource.medication.count.to_f / survivor_count,
      ammunition: Resource.ammunition.count.to_f / survivor_count

SELECT "resources".* FROM "resources" WHERE "resources"."survivor_id" IN (SELECT "survivors"."id" FROM "survivors" WHERE (infection_mark >= 3))
---
  def lost_infected_points
    render json: {
      lostPoints: Resource.where(survivor_id: Survivor.infected).map(&:points).inject(:+)

SELECT  1 AS one FROM "survivors" LIMIT ?  [["LIMIT", 1]]
SELECT "survivors"."id" FROM "survivors" WHERE (infection_mark >= 3)
---
  def check_survivors
    unless Survivor.exists?

SELECT COUNT(*) FROM "survivors" WHERE (infection_mark < 3)
---
  def survivor_count
    Survivor.not_infected.count.to_f

SELECT COUNT(*) FROM "survivors" WHERE (infection_mark < 3)
---
  def infected_survivor_count
    Survivor.infected.count.to_f

SELECT COUNT(*) FROM "survivors" WHERE (infection_mark >= 3)
---
  def all_survivors_count
    Survivor.all.count.to_f