app/controllers/reports_controller.rb

SELECT SUM("resources"."amount") FROM "resources" WHERE "resources"."type" = ?  [["type", "Water"]]
---
  def resources_by_survivor
    averages = {}

    Resource::RESOURCES_TYPES.each do |resource|
      resource_amount = Resource.public_send(resource).sum(:amount).to_f

SELECT "survivors"."id" FROM "survivors" WHERE (infection_mark >= 3)
SELECT "resources".* FROM "resources" WHERE 1=0
---
  def lost_infected_points
    @lost_points = 0
    infecteds = Survivor.infected.pluck(:id)
    resources = Resource.where(survivor_id: infecteds)
    resources.each do |resource|