app/controllers/survivors_controller.rb

SELECT "survivors".* FROM "survivors"
---
  def index
    @survivors = Survivor.all

INSERT INTO "resources" ("type", "survivor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["type", "Water"], ["survivor_id", 9], ["created_at", "2019-03-19 23:17:28.254311"], ["updated_at", "2019-03-19 23:17:28.254311"]]
INSERT INTO "survivors" ("name", "age", "gender", "latitude", "longitude") VALUES (?, ?, ?, ?, ?)  [["name", "Roberto Eustaquio"], ["age", 25], ["gender", "M"], ["latitude", -84.3879824], ["longitude", -84.3879824]]
---
  def create
    if resources_params.has_key?(:resources)
      @survivor = Survivor.new(survivor_params.merge(resources_attributes: resources_params[:resources]))

      if @survivor.save

UPDATE "survivors" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "survivors"."id" = ?  [["latitude", 234234.0], ["longitude", 234232342.0], ["updated_at", "2019-03-19 22:48:48.719307"], ["id", 3]]
---
  def update
    if @survivor.update_attributes(update_params)

UPDATE "survivors" SET "infection_mark" = ?, "updated_at" = ? WHERE "survivors"."id" = ?  [["infection_mark", 1], ["updated_at", "2019-03-19 23:31:31.553801"], ["id", 3]]
---
  def report_infection
    @survivor.increment(:infection_mark, 1).save

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_survivor
    @survivor = Survivor.find(params[:id])
    head :not_found if @survivor.blank?