app/controllers/survivors_controller.rb

SELECT "survivors".* FROM "survivors"
---
  def index
    @survivors = Survivor.all

INSERT INTO "resources" ("type", "survivor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["type", "Water"], ["survivor_id", 1], ["created_at", "2019-03-19 13:05:33.911098"], ["updated_at", "2019-03-19 13:05:33.911098"]]
INSERT INTO "survivors" ("name", "age", "gender", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Negan"], ["age", 47], ["gender", "M"], ["latitude", 38.89511], ["longitude", -77.03637], ["created_at", "2019-03-19 13:05:33.908955"], ["updated_at", "2019-03-19 13:05:33.908955"]]
---
  def create
    if resources_params.has_key?(:resources)
      @survivor = Survivor.new(survivor_params.merge(resources_attributes: resources_params[:resources]))

      if @survivor.save

UPDATE "survivors" SET "latitude" = ?, "longitude" = ? WHERE "survivors"."id" = ?  [["latitude", 40.73061], ["longitude", -73.935242], ["id", 1]]
---
  def update
    if @survivor.update_attributes(update_params)

UPDATE "survivors" SET "infection_mark" = ? WHERE "survivors"."id" = ?  [["infection_mark", 1], ["id", 1]]
---
  def report_infection
    @survivor.increment(:infection_mark, 1).save

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 999], ["LIMIT", 1]]
---
  def set_survivor
    @survivor = Survivor.find(params[:id])