app/controllers/trades_controller.rb

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def trade
    @survivor1 = Survivor.find(trade_params[:survivor1][:id])
    @survivor2 = Survivor.find(trade_params[:survivor2][:id])