app/controllers/trades_controller.rb

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def trade
    @survivor1 = Survivor.find(trade_params[:survivor1][:id])