app/models/trade.rb

  def trade_resources
    Resource.where(id: @survivor_1_resources).update_all(survivor_id: @survivor_2.id)
    Resource.where(id: @survivor_2_resources).update_all(survivor_id: @survivor_1.id)
---
SELECT  "resources".* FROM "resources" WHERE "resources"."type" = ? AND "resources"."survivor_id" = ? ORDER BY "resources"."id" ASC LIMIT ?  [["type", "Ammunition"], ["survivor_id", 3], ["LIMIT", 1]]
UPDATE "resources" SET "survivor_id" = 2 WHERE "resources"."id" = ?  [["id", 33]]
UPDATE "resources" SET "survivor_id" = 3 WHERE "resources"."id" = ?  [["id", 17]]

  def valid_resources?(survivor, resource)
    instance_variable_get("@#{survivor}").resources.where(type: resource[:type])
                                         .count >= resource[:amount].to_i
---
SELECT  "resources".* FROM "resources" WHERE "resources"."type" = ? AND "resources"."survivor_id" = ? ORDER BY "resources"."id" ASC LIMIT ?  [["type", "Water"], ["survivor_id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "resources" WHERE "resources"."survivor_id" = ? AND "resources"."type" = ?  [["survivor_id", 4], ["type", "Water"]]