app/models/trade.rb

SELECT  "resources".* FROM "resources" WHERE "resources"."survivor_id" = ? AND "resources"."type" = ? ORDER BY "resources"."id" ASC LIMIT ?  [["survivor_id", 4], ["type", "Water"], ["LIMIT", 1]]
INSERT INTO "resources" ("type", "amount", "survivor_id") VALUES (?, ?, ?)  [["type", "Ammunition"], ["amount", 0], ["survivor_id", 3]]
UPDATE "resources" SET "amount" = COALESCE("amount", 0) + 1 WHERE "resources"."type" IN ('Water') AND "resources"."id" = ?  [["id", 20]]
---
  def trade_resources
    survivors.each do |survivor|
      instance_variable_get("@#{survivor}_resources_params").each do |resource|
        @survivor_id = instance_variable_get("@#{survivor}_id")
        @resource_table = Resource.where(item: resource[:item], survivor_id: @survivor_id).first
        @resource_table.decrement!(:amount, resource[:amount])
        if survivor == :survivor1
          unless Resource.where(item: resource[:item], survivor_id: @survivor2.id).first.present?
            Resource.new(item: resource[:item], amount: 0, survivor_id: @survivor2.id).save
          end
          @resource_table = Resource.where(item: resource[:item], survivor_id: @survivor2.id).first
          @resource_table.increment!(:amount, resource[:amount])
        else
          unless Resource.where(item: resource[:item], survivor_id: @survivor1.id).first.present?
            Resource.new(item: resource[:item], amount: 0, survivor_id: @survivor1.id).save
          end
          @resource_table = Resource.where(item: resource[:item], survivor_id: @survivor1.id).first
          @resource_table.increment!(:amount, resource[:amount])

SELECT "resources"."amount" FROM "resources" WHERE "resources"."survivor_id" = ? AND "resources"."item" = ?  [["survivor_id", 1], ["item", "Medication"]]
---
  def valid_resources?(survivor, resource)
    instance_variable_get("@#{survivor}").resources.where(item: resource[:item]).pluck(:amount).first.to_i >= resource[:amount].to_i